artillery.test1.yaml
config:
  target: 'http://127.0.0.1:3001'
  phases:
    - duration: 60
      arrivalRate: 1
      name: '1 RPS'
    - duration: 60
      arrivalRate: 10
      name: '10 RPS'
    - duration: 60
      arrivalRate: 100
      name: '100 RPS'
    - duration: 60
      arrivalRate: 1000
      name: '1000 RPS'
scenarios:
  - flow:
    - get:
        url: '/api/products/35fefe18-aebe-497f-a41e-574a6a325c2b'